Revit 2026 API
RebarTrimExtendData.AddBarGeometry Method
Overload List
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>)
Top
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace